Revit 2027 API
ComponentRepeater.IsTypeValidForRepeater Method
 Determines whether given family type can be used as the default type for the repeater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTypeValidForRepeater(
	ElementId typeId
)
Public Function IsTypeValidForRepeater (
	typeId As ElementId
) As Boolean
public:
bool IsTypeValidForRepeater(
	ElementId^ typeId
)
member IsTypeValidForRepeater :
        typeId : ElementId -> bool
Parameters
typeId ElementId
 The element id of the type.
Return Value
Boolean
 True if the family type can be used as the default type for the repeater.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ComponentRepeater Class
Autodesk.Revit.DB Namespace